myapp/app/controllers/tasks_controller.rb

  def index
    query = Task.all
    query = query.sort_by_keyword(search_params[:sort]) if search_params[:sort].present?
---
SELECT `tasks`.* FROM `tasks`
SELECT 1 AS one FROM `tasks` LIMIT 1 OFFSET 0

  def create
    @task = Task.new(task_params)
    @task.owner_id = 1 # TODO: ログイン機能実装後に修正する
    @now = Time.new
    @task.created_at = @now
---
INSERT INTO `tasks` (`title`, `description`, `created_at`, `updated_at`) VALUES ('t 1', 't 2', '2024-08-20 03:03:31.725327', '2024-08-20 03:03:31.725327')